{"format": "graph-model", "generatedBy": "2.9.0", "convertedBy": "TensorFlow.js Converter v3.17.0", "signature": {"inputs": {"serving_default_inputs": {"name": "serving_default_inputs:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "128"}, {"size": "512"}, {"size": "3"}]}}}, "outputs": {"StatefulPartitionedCall": {"name": "StatefulPartitionedCall:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1725"}]}}}}, "modelTopology": {"node": [{"name": "mobile_net/universal_inverted_bottleneck_block_20/batch_normalization_2/FusedBatchNormV3_mobile_net/universal_inverted_bottleneck_block_20/conv2d_1/Conv2D/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "depthwise_29/filter_in", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "256"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "mobile_net/universal_inverted_bottleneck_block_20/batch_normalization/FusedBatchNormV3_mobile_net/universal_inverted_bottleneck_block_20/depthwise_conv2d/depthwise/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}}, {"name": "Conv2D_43/filter", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "256"}, {"size": "512"}]}}}}}, {"name": "Add_35/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}}, {"name": "Conv2D_44/filter", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "512"}, {"size": "256"}]}}}}}, {"name": "mobile_net/universal_inverted_bottleneck_block_19/batch_normalization_1/FusedBatchNormV3_mobile_net/universal_inverted_bottleneck_block_19/conv2d_1/Conv2D/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Conv2D_41/filter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "256"}, {"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Add_34/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Conv2D_42/filter", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1024"}, {"size": "256"}]}}}}}, {"name": "mobile_net/universal_inverted_bottleneck_block_18/batch_normalization_1/FusedBatchNormV3_mobile_net/universal_inverted_bottleneck_block_18/conv2d_1/Conv2D/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}}, {"name": "Conv2D_39/filter", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "256"}, {"size": "1024"}]}}}}}, {"name": "Add_33/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Conv2D_40/filter", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1024"}, {"size": "256"}]}}}}}, {"name": "mobile_net/universal_inverted_bottleneck_block_17/batch_normalization_3/FusedBatchNormV3_mobile_net/universal_inverted_bottleneck_block_17/conv2d_1/Conv2D/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "depthwise_27/filter_in", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "256"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "mobile_net/universal_inverted_bottleneck_block_17/batch_normalization/FusedBatchNormV3_mobile_net/universal_inverted_bottleneck_block_17/depthwise_conv2d/depthwise/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}}, {"name": "Conv2D_37/filter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "256"}, {"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Add_31/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}]}}}}}, {"name": "depthwise_28/filter_in", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "1024"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Add_32/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Conv2D_38/filter", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1024"}, {"size": "256"}]}}}}}, {"name": "mobile_net/universal_inverted_bottleneck_block_16/batch_normalization_3/FusedBatchNormV3_mobile_net/universal_inverted_bottleneck_block_16/conv2d_1/Conv2D/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "depthwise_25/filter_in", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "1"}]}}}}}, {"name": "mobile_net/universal_inverted_bottleneck_block_16/batch_normalization/FusedBatchNormV3_mobile_net/universal_inverted_bottleneck_block_16/depthwise_conv2d/depthwise/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}}, {"name": "Conv2D_35/filter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "256"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Add_29/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "depthwise_26/filter_in", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "512"}, {"size": "1"}]}}}}}, {"name": "Add_30/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}}, {"name": "Conv2D_36/filter", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "512"}, {"size": "256"}]}}}}}, {"name": "mobile_net/universal_inverted_bottleneck_block_15/batch_normalization_2/FusedBatchNormV3_mobile_net/universal_inverted_bottleneck_block_15/conv2d_1/Conv2D/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "depthwise_24/filter_in", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "1"}]}}}}}, {"name": "mobile_net/universal_inverted_bottleneck_block_15/batch_normalization/FusedBatchNormV3_mobile_net/universal_inverted_bottleneck_block_15/depthwise_conv2d/depthwise/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Conv2D_33/filter", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "256"}, {"size": "1024"}]}}}}}, {"name": "Add_28/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}]}}}}}, {"name": "Conv2D_34/filter", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1024"}, {"size": "256"}]}}}}}, {"name": "mobile_net/universal_inverted_bottleneck_block_14/batch_normalization_1/FusedBatchNormV3_mobile_net/universal_inverted_bottleneck_block_14/conv2d_1/Conv2D/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Conv2D_31/filter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "256"}, {"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Add_27/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}]}}}}}, {"name": "Conv2D_32/filter", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1024"}, {"size": "256"}]}}}}}, {"name": "mobile_net/universal_inverted_bottleneck_block_13/batch_normalization_3/FusedBatchNormV3_mobile_net/universal_inverted_bottleneck_block_13/conv2d_1/Conv2D/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "depthwise_22/filter_in", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "1"}]}}}}}, {"name": "mobile_net/universal_inverted_bottleneck_block_13/batch_normalization/FusedBatchNormV3_mobile_net/universal_inverted_bottleneck_block_13/depthwise_conv2d/depthwise/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Conv2D_29/filter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "256"}, {"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Add_25/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "depthwise_23/filter_in", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "1024"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Add_26/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}]}}}}}, {"name": "Conv2D_30/filter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1024"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "mobile_net/universal_inverted_bottleneck_block_12/batch_normalization_3/FusedBatchNormV3_mobile_net/universal_inverted_bottleneck_block_12/conv2d_1/Conv2D/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "depthwise_20/filter_in", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "mobile_net/universal_inverted_bottleneck_block_12/batch_normalization/FusedBatchNormV3_mobile_net/universal_inverted_bottleneck_block_12/depthwise_conv2d/depthwise/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Conv2D_27/filter", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "256"}, {"size": "1024"}]}}}}}, {"name": "Add_23/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}]}}}}}, {"name": "depthwise_21/filter_in", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "1024"}, {"size": "1"}]}}}}}, {"name": "Add_24/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Conv2D_28/filter", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1024"}, {"size": "256"}]}}}}}, {"name": "mobile_net/universal_inverted_bottleneck_block_11/batch_normalization_3/FusedBatchNormV3_mobile_net/universal_inverted_bottleneck_block_11/conv2d_1/Conv2D/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "depthwise_18/filter_in", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "256"}, {"size": "1"}]}}}}}, {"name": "mobile_net/universal_inverted_bottleneck_block_11/batch_normalization/FusedBatchNormV3_mobile_net/universal_inverted_bottleneck_block_11/depthwise_conv2d/depthwise/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}}, {"name": "Conv2D_25/filter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "256"}, {"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Add_21/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "depthwise_19/filter_in", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "1024"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Add_22/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}]}}}}}, {"name": "Conv2D_26/filter", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1024"}, {"size": "256"}]}}}}}, {"name": "mobile_net/universal_inverted_bottleneck_block_9/batch_normalization_2/FusedBatchNormV3_mobile_net/universal_inverted_bottleneck_block_9/conv2d_1/Conv2D/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "160"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "depthwise_15/filter_in", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "160"}, {"size": "1"}]}}}}}, {"name": "mobile_net/universal_inverted_bottleneck_block_9/batch_normalization/FusedBatchNormV3_mobile_net/universal_inverted_bottleneck_block_9/depthwise_conv2d/depthwise/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "160"}]}}}}}, {"name": "Conv2D_21/filter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "160"}, {"size": "640"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Add_18/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "640"}]}}}}}, {"name": "Conv2D_22/filter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "640"}, {"size": "160"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "mobile_net/universal_inverted_bottleneck_block_8/batch_normalization_1/FusedBatchNormV3_mobile_net/universal_inverted_bottleneck_block_8/conv2d_1/Conv2D/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "160"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Conv2D_19/filter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "160"}, {"size": "320"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Add_17/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "320"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Conv2D_20/filter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "320"}, {"size": "160"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "mobile_net/universal_inverted_bottleneck_block_7/batch_normalization_2/FusedBatchNormV3_mobile_net/universal_inverted_bottleneck_block_7/conv2d_1/Conv2D/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "160"}]}}}}}, {"name": "depthwise_14/filter_in", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "160"}, {"size": "1"}]}}}}}, {"name": "mobile_net/universal_inverted_bottleneck_block_7/batch_normalization/FusedBatchNormV3_mobile_net/universal_inverted_bottleneck_block_7/depthwise_conv2d/depthwise/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "160"}]}}}}}, {"name": "Conv2D_17/filter", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "160"}, {"size": "640"}]}}}}}, {"name": "Add_16/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "640"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Conv2D_18/filter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "640"}, {"size": "160"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "mobile_net/universal_inverted_bottleneck_block_6/batch_normalization_3/FusedBatchNormV3_mobile_net/universal_inverted_bottleneck_block_6/conv2d_1/Conv2D/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "160"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "depthwise_12/filter_in", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "160"}, {"size": "1"}]}}}}}, {"name": "mobile_net/universal_inverted_bottleneck_block_6/batch_normalization/FusedBatchNormV3_mobile_net/universal_inverted_bottleneck_block_6/depthwise_conv2d/depthwise/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "160"}]}}}}}, {"name": "Conv2D_15/filter", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "160"}, {"size": "640"}]}}}}}, {"name": "Add_14/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "640"}]}}}}}, {"name": "depthwise_13/filter_in", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "640"}, {"size": "1"}]}}}}}, {"name": "Add_15/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "640"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Conv2D_16/filter", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "640"}, {"size": "160"}]}}}}}, {"name": "mobile_net/universal_inverted_bottleneck_block_5/batch_normalization_3/FusedBatchNormV3_mobile_net/universal_inverted_bottleneck_block_5/conv2d_1/Conv2D/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "160"}]}}}}}, {"name": "depthwise_10/filter_in", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "160"}, {"size": "1"}]}}}}}, {"name": "mobile_net/universal_inverted_bottleneck_block_5/batch_normalization/FusedBatchNormV3_mobile_net/universal_inverted_bottleneck_block_5/depthwise_conv2d/depthwise/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "160"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Conv2D_13/filter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "160"}, {"size": "640"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Add_12/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "640"}]}}}}}, {"name": "depthwise_11/filter_in", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "640"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Add_13/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "640"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Conv2D_14/filter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "640"}, {"size": "160"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "mobile_net/universal_inverted_bottleneck_block_4/batch_normalization_3/FusedBatchNormV3_mobile_net/universal_inverted_bottleneck_block_4/conv2d_1/Conv2D/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "160"}]}}}}}, {"name": "depthwise_8/filter_in", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "160"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "mobile_net/universal_inverted_bottleneck_block_4/batch_normalization/FusedBatchNormV3_mobile_net/universal_inverted_bottleneck_block_4/depthwise_conv2d/depthwise/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "160"}]}}}}}, {"name": "Conv2D_11/filter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "160"}, {"size": "640"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Add_10/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "640"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "depthwise_9/filter_in", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "640"}, {"size": "1"}]}}}}}, {"name": "Add_11/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "640"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Conv2D_12/filter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "640"}, {"size": "160"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "mobile_net/universal_inverted_bottleneck_block_3/batch_normalization_3/FusedBatchNormV3_mobile_net/universal_inverted_bottleneck_block_3/conv2d_1/Conv2D/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "160"}]}}}}}, {"name": "depthwise_6/filter_in", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "160"}, {"size": "1"}]}}}}}, {"name": "mobile_net/universal_inverted_bottleneck_block_3/batch_normalization/FusedBatchNormV3_mobile_net/universal_inverted_bottleneck_block_3/depthwise_conv2d/depthwise/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "160"}]}}}}}, {"name": "Conv2D_9/filter", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "160"}, {"size": "640"}]}}}}}, {"name": "Add_8/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "640"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "depthwise_7/filter_in", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "640"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Add_9/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "640"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Conv2D_10/filter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "640"}, {"size": "160"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "mobile_net/universal_inverted_bottleneck_block_1/batch_normalization_3/FusedBatchNormV3_mobile_net/universal_inverted_bottleneck_block_1/conv2d_1/Conv2D/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "80"}]}}}}}, {"name": "depthwise_2/filter_in", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "80"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "mobile_net/universal_inverted_bottleneck_block_1/batch_normalization/FusedBatchNormV3_mobile_net/universal_inverted_bottleneck_block_1/depthwise_conv2d/depthwise/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "80"}]}}}}}, {"name": "Conv2D_5/filter", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "80"}, {"size": "160"}]}}}}}, {"name": "Add_4/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "160"}]}}}}}, {"name": "depthwise_3/filter_in", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "160"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Add_5/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "160"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Conv2D_6/filter", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "160"}, {"size": "80"}]}}}}}, {"name": "Conv2D/filter", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "32"}]}}}}}, {"name": "Add/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Conv2D_1/filter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Add_1/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Conv2D_2/filter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}, {"size": "48"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "mobile_net/inverted_bottleneck_block/batch_normalization_1/FusedBatchNormV3_mobile_net/inverted_bottleneck_block/conv2d_1/Conv2D/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "48"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "depthwise/filter_in", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "48"}, {"size": "1"}]}}}}}, {"name": "mobile_net/universal_inverted_bottleneck_block/batch_normalization/FusedBatchNormV3_mobile_net/universal_inverted_bottleneck_block/depthwise_conv2d/depthwise/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "48"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Conv2D_3/filter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "48"}, {"size": "192"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Add_2/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "192"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "depthwise_1/filter_in", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "192"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Add_3/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "192"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Conv2D_4/filter", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "192"}, {"size": "80"}]}}}}}, {"name": "mobile_net/universal_inverted_bottleneck_block/batch_normalization_3/FusedBatchNormV3_mobile_net/universal_inverted_bottleneck_block/conv2d_1/Conv2D/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "80"}]}}}}}, {"name": "depthwise_4/filter_in", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "80"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "mobile_net/universal_inverted_bottleneck_block_2/batch_normalization/FusedBatchNormV3_mobile_net/universal_inverted_bottleneck_block_2/depthwise_conv2d/depthwise/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "80"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Conv2D_7/filter", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "80"}, {"size": "480"}]}}}}}, {"name": "Add_6/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "480"}]}}}}}, {"name": "depthwise_5/filter_in", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "480"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Add_7/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "480"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Conv2D_8/filter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "480"}, {"size": "160"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "mobile_net/universal_inverted_bottleneck_block_2/batch_normalization_3/FusedBatchNormV3_mobile_net/universal_inverted_bottleneck_block_2/conv2d_1/Conv2D/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "160"}]}}}}}, {"name": "depthwise_16/filter_in", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "160"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "mobile_net/universal_inverted_bottleneck_block_10/batch_normalization/FusedBatchNormV3_mobile_net/universal_inverted_bottleneck_block_10/depthwise_conv2d/depthwise/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "160"}]}}}}}, {"name": "Conv2D_23/filter", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "160"}, {"size": "960"}]}}}}}, {"name": "Add_19/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "960"}]}}}}}, {"name": "depthwise_17/filter_in", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "960"}, {"size": "1"}]}}}}}, {"name": "Add_20/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "960"}]}}}}}, {"name": "Conv2D_24/filter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "960"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "mobile_net/universal_inverted_bottleneck_block_10/batch_normalization_3/FusedBatchNormV3_mobile_net/universal_inverted_bottleneck_block_10/conv2d_1/Conv2D/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}}, {"name": "Conv2D_45/filter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "256"}, {"size": "960"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Add_36/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "960"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "mobile_net/global_average_pooling2d/Mean/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "Conv2D_46/filter", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "960"}, {"size": "1280"}]}}}}}, {"name": "Add_37/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1280"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "global_average_pooling2d_1/Mean/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "dense_1/MatMul_dense_1/BiasAdd_dense/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1280"}, {"size": "1725"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "dense_1/MatMul_dense_1/BiasAdd_dense/bias", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1725"}]}}}}}, {"name": "serving_default_inputs", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "1"}, {"size": "128"}, {"size": "512"}, {"size": "3"}]}}}}, {"name": "Conv2D", "op": "Conv2D", "input": ["serving_default_inputs", "Conv2D/filter"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "padding": {"s": "U0FNRQ=="}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}}}, {"name": "Add", "op": "AddV2", "input": ["Conv2D", "Add/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "mobile_net/conv2dbn_block/activation/Relu_mobile_net/conv2dbn_block/batch_normalization/FusedBatchNormV3_mobile_net/conv2dbn_block/conv2d/Conv2D1", "op": "Relu", "input": ["Add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Conv2D_1", "op": "Conv2D", "input": ["mobile_net/conv2dbn_block/activation/Relu_mobile_net/conv2dbn_block/batch_normalization/FusedBatchNormV3_mobile_net/conv2dbn_block/conv2d/Conv2D1", "Conv2D_1/filter"], "device": "/device:CPU:0", "attr": {"explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}}}, {"name": "Add_1", "op": "AddV2", "input": ["Conv2D_1", "Add_1/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "mobile_net/inverted_bottleneck_block/activation/Relu_mobile_net/inverted_bottleneck_block/batch_normalization/FusedBatchNormV3_mobile_net/inverted_bottleneck_block/conv2d/Conv2D", "op": "Relu", "input": ["Add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Conv2D_2", "op": "Conv2D", "input": ["mobile_net/inverted_bottleneck_block/activation/Relu_mobile_net/inverted_bottleneck_block/batch_normalization/FusedBatchNormV3_mobile_net/inverted_bottleneck_block/conv2d/Conv2D", "Conv2D_2/filter"], "device": "/device:CPU:0", "attr": {"explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "mobile_net/inverted_bottleneck_block/batch_normalization_1/FusedBatchNormV3_mobile_net/inverted_bottleneck_block/conv2d_1/Conv2D", "op": "AddV2", "input": ["Conv2D_2", "mobile_net/inverted_bottleneck_block/batch_normalization_1/FusedBatchNormV3_mobile_net/inverted_bottleneck_block/conv2d_1/Conv2D/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "depthwise", "op": "DepthwiseConv2dNative", "input": ["mobile_net/inverted_bottleneck_block/batch_normalization_1/FusedBatchNormV3_mobile_net/inverted_bottleneck_block/conv2d_1/Conv2D", "depthwise/filter_in"], "attr": {"data_format": {"s": "TkhXQw=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}}}, {"name": "mobile_net/universal_inverted_bottleneck_block/batch_normalization/FusedBatchNormV3_mobile_net/universal_inverted_bottleneck_block/depthwise_conv2d/depthwise", "op": "AddV2", "input": ["depthwise", "mobile_net/universal_inverted_bottleneck_block/batch_normalization/FusedBatchNormV3_mobile_net/universal_inverted_bottleneck_block/depthwise_conv2d/depthwise/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Conv2D_3", "op": "Conv2D", "input": ["mobile_net/universal_inverted_bottleneck_block/batch_normalization/FusedBatchNormV3_mobile_net/universal_inverted_bottleneck_block/depthwise_conv2d/depthwise", "Conv2D_3/filter"], "device": "/device:CPU:0", "attr": {"use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "Add_2", "op": "AddV2", "input": ["Conv2D_3", "Add_2/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "mobile_net/universal_inverted_bottleneck_block/activation/Relu_mobile_net/universal_inverted_bottleneck_block/batch_normalization_1/FusedBatchNormV3_mobile_net/universal_inverted_bottleneck_block/conv2d/Conv2D", "op": "Relu", "input": ["Add_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "depthwise_1", "op": "DepthwiseConv2dNative", "input": ["mobile_net/universal_inverted_bottleneck_block/activation/Relu_mobile_net/universal_inverted_bottleneck_block/batch_normalization_1/FusedBatchNormV3_mobile_net/universal_inverted_bottleneck_block/conv2d/Conv2D", "depthwise_1/filter_in"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "U0FNRQ=="}, "explicit_paddings": {"list": {}}}}, {"name": "Add_3", "op": "AddV2", "input": ["depthwise_1", "Add_3/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "mobile_net/universal_inverted_bottleneck_block/activation_1/Relu_mobile_net/universal_inverted_bottleneck_block/batch_normalization_2/FusedBatchNormV3_mobile_net/universal_inverted_bottleneck_block/depthwise_conv2d_1/depthwise", "op": "Relu", "input": ["Add_3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Conv2D_4", "op": "Conv2D", "input": ["mobile_net/universal_inverted_bottleneck_block/activation_1/Relu_mobile_net/universal_inverted_bottleneck_block/batch_normalization_2/FusedBatchNormV3_mobile_net/universal_inverted_bottleneck_block/depthwise_conv2d_1/depthwise", "Conv2D_4/filter"], "device": "/device:CPU:0", "attr": {"explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "mobile_net/universal_inverted_bottleneck_block/batch_normalization_3/FusedBatchNormV3_mobile_net/universal_inverted_bottleneck_block/conv2d_1/Conv2D", "op": "AddV2", "input": ["Conv2D_4", "mobile_net/universal_inverted_bottleneck_block/batch_normalization_3/FusedBatchNormV3_mobile_net/universal_inverted_bottleneck_block/conv2d_1/Conv2D/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "depthwise_2", "op": "DepthwiseConv2dNative", "input": ["mobile_net/universal_inverted_bottleneck_block/batch_normalization_3/FusedBatchNormV3_mobile_net/universal_inverted_bottleneck_block/conv2d_1/Conv2D", "depthwise_2/filter_in"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}}}, {"name": "mobile_net/universal_inverted_bottleneck_block_1/batch_normalization/FusedBatchNormV3_mobile_net/universal_inverted_bottleneck_block_1/depthwise_conv2d/depthwise", "op": "AddV2", "input": ["depthwise_2", "mobile_net/universal_inverted_bottleneck_block_1/batch_normalization/FusedBatchNormV3_mobile_net/universal_inverted_bottleneck_block_1/depthwise_conv2d/depthwise/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Conv2D_5", "op": "Conv2D", "input": ["mobile_net/universal_inverted_bottleneck_block_1/batch_normalization/FusedBatchNormV3_mobile_net/universal_inverted_bottleneck_block_1/depthwise_conv2d/depthwise", "Conv2D_5/filter"], "device": "/device:CPU:0", "attr": {"data_format": {"s": "TkhXQw=="}, "padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "Add_4", "op": "AddV2", "input": ["Conv2D_5", "Add_4/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "mobile_net/universal_inverted_bottleneck_block_1/activation/Relu_mobile_net/universal_inverted_bottleneck_block_1/batch_normalization_1/FusedBatchNormV3_mobile_net/universal_inverted_bottleneck_block_1/conv2d/Conv2D", "op": "Relu", "input": ["Add_4"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "depthwise_3", "op": "DepthwiseConv2dNative", "input": ["mobile_net/universal_inverted_bottleneck_block_1/activation/Relu_mobile_net/universal_inverted_bottleneck_block_1/batch_normalization_1/FusedBatchNormV3_mobile_net/universal_inverted_bottleneck_block_1/conv2d/Conv2D", "depthwise_3/filter_in"], "attr": {"padding": {"s": "U0FNRQ=="}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "Add_5", "op": "AddV2", "input": ["depthwise_3", "Add_5/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "mobile_net/universal_inverted_bottleneck_block_1/activation_1/Relu_mobile_net/universal_inverted_bottleneck_block_1/batch_normalization_2/FusedBatchNormV3_mobile_net/universal_inverted_bottleneck_block_1/depthwise_conv2d_1/depthwise", "op": "Relu", "input": ["Add_5"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Conv2D_6", "op": "Conv2D", "input": ["mobile_net/universal_inverted_bottleneck_block_1/activation_1/Relu_mobile_net/universal_inverted_bottleneck_block_1/batch_normalization_2/FusedBatchNormV3_mobile_net/universal_inverted_bottleneck_block_1/depthwise_conv2d_1/depthwise", "Conv2D_6/filter"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "mobile_net/universal_inverted_bottleneck_block_1/ArithmeticOptimizer/AddOpsRewrite_Leaf_1_add", "op": "AddN", "input": ["Conv2D_6", "mobile_net/universal_inverted_bottleneck_block/batch_normalization_3/FusedBatchNormV3_mobile_net/universal_inverted_bottleneck_block/conv2d_1/Conv2D"], "attr": {"_grappler_ArithmeticOptimizer_AddOpsRewriteStage": {"b": true}, "T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "mobile_net/universal_inverted_bottleneck_block_1/ArithmeticOptimizer/AddOpsRewrite_add", "op": "AddV2", "input": ["mobile_net/universal_inverted_bottleneck_block_1/batch_normalization_3/FusedBatchNormV3_mobile_net/universal_inverted_bottleneck_block_1/conv2d_1/Conv2D/y", "mobile_net/universal_inverted_bottleneck_block_1/ArithmeticOptimizer/AddOpsRewrite_Leaf_1_add"], "attr": {"T": {"type": "DT_FLOAT"}, "_grappler_ArithmeticOptimizer_AddOpsRewriteStage": {"b": true}}}, {"name": "depthwise_4", "op": "DepthwiseConv2dNative", "input": ["mobile_net/universal_inverted_bottleneck_block_1/ArithmeticOptimizer/AddOpsRewrite_add", "depthwise_4/filter_in"], "attr": {"T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}}}, {"name": "mobile_net/universal_inverted_bottleneck_block_2/batch_normalization/FusedBatchNormV3_mobile_net/universal_inverted_bottleneck_block_2/depthwise_conv2d/depthwise", "op": "AddV2", "input": ["depthwise_4", "mobile_net/universal_inverted_bottleneck_block_2/batch_normalization/FusedBatchNormV3_mobile_net/universal_inverted_bottleneck_block_2/depthwise_conv2d/depthwise/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Conv2D_7", "op": "Conv2D", "input": ["mobile_net/universal_inverted_bottleneck_block_2/batch_normalization/FusedBatchNormV3_mobile_net/universal_inverted_bottleneck_block_2/depthwise_conv2d/depthwise", "Conv2D_7/filter"], "device": "/device:CPU:0", "attr": {"data_format": {"s": "TkhXQw=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}}}, {"name": "Add_6", "op": "AddV2", "input": ["Conv2D_7", "Add_6/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "mobile_net/universal_inverted_bottleneck_block_2/activation/Relu_mobile_net/universal_inverted_bottleneck_block_2/batch_normalization_1/FusedBatchNormV3_mobile_net/universal_inverted_bottleneck_block_2/conv2d/Conv2D", "op": "Relu", "input": ["Add_6"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "depthwise_5", "op": "DepthwiseConv2dNative", "input": ["mobile_net/universal_inverted_bottleneck_block_2/activation/Relu_mobile_net/universal_inverted_bottleneck_block_2/batch_normalization_1/FusedBatchNormV3_mobile_net/universal_inverted_bottleneck_block_2/conv2d/Conv2D", "depthwise_5/filter_in"], "attr": {"T": {"type": "DT_FLOAT"}, "padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}}}, {"name": 