{"format": "graph-model", "generatedBy": "2.9.0", "convertedBy": "TensorFlow.js Converter v3.17.0", "signature": {"inputs": {"serving_default_week_of_year:0": {"name": "serving_default_week_of_year:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}, "serving_default_longitude:0": {"name": "serving_default_longitude:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}, "serving_default_latitude:0": {"name": "serving_default_latitude:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "outputs": {"StatefulPartitionedCall": {"name": "StatefulPartitionedCall:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "2233"}]}}}}, "modelTopology": {"node": [{"name": "truediv_truediv/y1", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "truediv_1_truediv_1/y1", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "truediv_2_truediv_2/y1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "sub/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "mul_5/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "geo_prior_model_v1_1/dense_18/MatMul_geo_prior_model_v1_1/activation_17/Relu_geo_prior_model_v1_1/dense_18/BiasAdd_dense/kernel", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "6"}, {"size": "128"}]}}}}}, {"name": "geo_prior_model_v1_1/dense_18/MatMul_geo_prior_model_v1_1/activation_17/Relu_geo_prior_model_v1_1/dense_18/BiasAdd_dense/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "geo_prior_model_v1_1/residual_layer_8/dense_19/MatMul_geo_prior_model_v1_1/residual_layer_8/activation_18/Relu_geo_prior_model_v1_1/residual_layer_8/dense_19/BiasAdd_dense/kernel", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "128"}]}}}}}, {"name": "geo_prior_model_v1_1/residual_layer_8/dense_19/MatMul_geo_prior_model_v1_1/residual_layer_8/activation_18/Relu_geo_prior_model_v1_1/residual_layer_8/dense_19/BiasAdd_dense/bias", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "geo_prior_model_v1_1/residual_layer_8/dense_20/MatMul_geo_prior_model_v1_1/residual_layer_8/activation_19/Relu_geo_prior_model_v1_1/residual_layer_8/dense_20/BiasAdd_dense/kernel", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "128"}]}}}}}, {"name": "geo_prior_model_v1_1/residual_layer_8/dense_20/MatMul_geo_prior_model_v1_1/residual_layer_8/activation_19/Relu_geo_prior_model_v1_1/residual_layer_8/dense_20/BiasAdd_dense/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "geo_prior_model_v1_1/residual_layer_9/dense_21/MatMul_geo_prior_model_v1_1/residual_layer_9/activation_20/Relu_geo_prior_model_v1_1/residual_layer_9/dense_21/BiasAdd_dense/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "geo_prior_model_v1_1/residual_layer_9/dense_21/MatMul_geo_prior_model_v1_1/residual_layer_9/activation_20/Relu_geo_prior_model_v1_1/residual_layer_9/dense_21/BiasAdd_dense/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "geo_prior_model_v1_1/residual_layer_9/dense_22/MatMul_geo_prior_model_v1_1/residual_layer_9/activation_21/Relu_geo_prior_model_v1_1/residual_layer_9/dense_22/BiasAdd_dense/kernel", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "128"}]}}}}}, {"name": "geo_prior_model_v1_1/residual_layer_9/dense_22/MatMul_geo_prior_model_v1_1/residual_layer_9/activation_21/Relu_geo_prior_model_v1_1/residual_layer_9/dense_22/BiasAdd_dense/bias", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "geo_prior_model_v1_1/residual_layer_10/dense_23/MatMul_geo_prior_model_v1_1/residual_layer_10/activation_22/Relu_geo_prior_model_v1_1/residual_layer_10/dense_23/BiasAdd_dense/kernel", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "128"}]}}}}}, {"name": "geo_prior_model_v1_1/residual_layer_10/dense_23/MatMul_geo_prior_model_v1_1/residual_layer_10/activation_22/Relu_geo_prior_model_v1_1/residual_layer_10/dense_23/BiasAdd_dense/bias", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "geo_prior_model_v1_1/residual_layer_10/dense_24/MatMul_geo_prior_model_v1_1/residual_layer_10/activation_23/Relu_geo_prior_model_v1_1/residual_layer_10/dense_24/BiasAdd_dense/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "geo_prior_model_v1_1/residual_layer_10/dense_24/MatMul_geo_prior_model_v1_1/residual_layer_10/activation_23/Relu_geo_prior_model_v1_1/residual_layer_10/dense_24/BiasAdd_dense/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "geo_prior_model_v1_1/residual_layer_11/dense_25/MatMul_geo_prior_model_v1_1/residual_layer_11/activation_24/Relu_geo_prior_model_v1_1/residual_layer_11/dense_25/BiasAdd_dense/kernel", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "128"}]}}}}}, {"name": "geo_prior_model_v1_1/residual_layer_11/dense_25/MatMul_geo_prior_model_v1_1/residual_layer_11/activation_24/Relu_geo_prior_model_v1_1/residual_layer_11/dense_25/BiasAdd_dense/bias", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "geo_prior_model_v1_1/residual_layer_11/dense_26/MatMul_geo_prior_model_v1_1/residual_layer_11/activation_25/Relu_geo_prior_model_v1_1/residual_layer_11/dense_26/BiasAdd_dense/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "geo_prior_model_v1_1/residual_layer_11/dense_26/MatMul_geo_prior_model_v1_1/residual_layer_11/activation_25/Relu_geo_prior_model_v1_1/residual_layer_11/dense_26/BiasAdd_dense/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "geo_prior_model_v1_1/residual_layer_12/dense_27/MatMul_geo_prior_model_v1_1/residual_layer_12/activation_26/Relu_geo_prior_model_v1_1/residual_layer_12/dense_27/BiasAdd_dense/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "geo_prior_model_v1_1/residual_layer_12/dense_27/MatMul_geo_prior_model_v1_1/residual_layer_12/activation_26/Relu_geo_prior_model_v1_1/residual_layer_12/dense_27/BiasAdd_dense/bias", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "geo_prior_model_v1_1/residual_layer_12/dense_28/MatMul_geo_prior_model_v1_1/residual_layer_12/activation_27/Relu_geo_prior_model_v1_1/residual_layer_12/dense_28/BiasAdd_dense/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "geo_prior_model_v1_1/residual_layer_12/dense_28/MatMul_geo_prior_model_v1_1/residual_layer_12/activation_27/Relu_geo_prior_model_v1_1/residual_layer_12/dense_28/BiasAdd_dense/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "geo_prior_model_v1_1/residual_layer_13/dense_29/MatMul_geo_prior_model_v1_1/residual_layer_13/activation_28/Relu_geo_prior_model_v1_1/residual_layer_13/dense_29/BiasAdd_dense/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "geo_prior_model_v1_1/residual_layer_13/dense_29/MatMul_geo_prior_model_v1_1/residual_layer_13/activation_28/Relu_geo_prior_model_v1_1/residual_layer_13/dense_29/BiasAdd_dense/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "geo_prior_model_v1_1/residual_layer_13/dense_30/MatMul_geo_prior_model_v1_1/residual_layer_13/activation_29/Relu_geo_prior_model_v1_1/residual_layer_13/dense_30/BiasAdd_dense/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "geo_prior_model_v1_1/residual_layer_13/dense_30/MatMul_geo_prior_model_v1_1/residual_layer_13/activation_29/Relu_geo_prior_model_v1_1/residual_layer_13/dense_30/BiasAdd_dense/bias", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "geo_prior_model_v1_1/residual_layer_14/dense_31/MatMul_geo_prior_model_v1_1/residual_layer_14/activation_30/Relu_geo_prior_model_v1_1/residual_layer_14/dense_31/BiasAdd_dense/kernel", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "128"}]}}}}}, {"name": "geo_prior_model_v1_1/residual_layer_14/dense_31/MatMul_geo_prior_model_v1_1/residual_layer_14/activation_30/Relu_geo_prior_model_v1_1/residual_layer_14/dense_31/BiasAdd_dense/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "geo_prior_model_v1_1/residual_layer_14/dense_32/MatMul_geo_prior_model_v1_1/residual_layer_14/activation_31/Relu_geo_prior_model_v1_1/residual_layer_14/dense_32/BiasAdd_dense/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "geo_prior_model_v1_1/residual_layer_14/dense_32/MatMul_geo_prior_model_v1_1/residual_layer_14/activation_31/Relu_geo_prior_model_v1_1/residual_layer_14/dense_32/BiasAdd_dense/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "geo_prior_model_v1_1/residual_layer_15/dense_33/MatMul_geo_prior_model_v1_1/residual_layer_15/activation_32/Relu_geo_prior_model_v1_1/residual_layer_15/dense_33/BiasAdd_dense/kernel", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "128"}]}}}}}, {"name": "geo_prior_model_v1_1/residual_layer_15/dense_33/MatMul_geo_prior_model_v1_1/residual_layer_15/activation_32/Relu_geo_prior_model_v1_1/residual_layer_15/dense_33/BiasAdd_dense/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "geo_prior_model_v1_1/residual_layer_15/dense_34/MatMul_geo_prior_model_v1_1/residual_layer_15/activation_33/Relu_geo_prior_model_v1_1/residual_layer_15/dense_34/BiasAdd_dense/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "geo_prior_model_v1_1/residual_layer_15/dense_34/MatMul_geo_prior_model_v1_1/residual_layer_15/activation_33/Relu_geo_prior_model_v1_1/residual_layer_15/dense_34/BiasAdd_dense/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "geo_prior_model_v1_1/dense_35/MatMul_geo_prior_model_v1_1/dense_35/BiasAdd_dense/kernel", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "2233"}]}}}}}, {"name": "geo_prior_model_v1_1/dense_35/MatMul_geo_prior_model_v1_1/dense_35/BiasAdd_dense/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2233"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "serving_default_latitude", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "1"}]}}}}, {"name": "serving_default_longitude", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "1"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "serving_default_week_of_year", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "1"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "mul_1", "op": "Mul", "input": ["serving_default_latitude", "truediv_truediv/y1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "mul_3", "op": "Mul", "input": ["serving_default_longitude", "truediv_1_truediv_1/y1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "mul", "op": "Mul", "input": ["serving_default_week_of_year", "truediv_2_truediv_2/y1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Sin", "op": "Sin", "input": ["mul_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Cos", "op": "Cos", "input": ["mul_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Sin_1", "op": "Sin", "input": ["mul_3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Cos_1", "op": "Cos", "input": ["mul_3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sub", "op": "Sub", "input": ["mul", "sub/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "mul_5", "op": "Mul", "input": ["sub", "mul_5/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Sin_2", "op": "Sin", "input": ["mul_5"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Cos_2", "op": "Cos", "input": ["mul_5"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "stack", "op": "Pack", "input": ["Sin", "Cos", "Sin_1", "Cos_1", "Sin_2", "Cos_2"], "attr": {"axis": {"i": "0"}, "T": {"type": "DT_FLOAT"}, "N": {"i": "6"}}}, {"name": "geo_prior_model_v1_1/dense_18/MatMul_geo_prior_model_v1_1/activation_17/Relu_geo_prior_model_v1_1/dense_18/BiasAdd_dense/Relu", "op": "_FusedMatMul", "input": ["stack", "geo_prior_model_v1_1/dense_18/MatMul_geo_prior_model_v1_1/activation_17/Relu_geo_prior_model_v1_1/dense_18/BiasAdd_dense/kernel", "geo_prior_model_v1_1/dense_18/MatMul_geo_prior_model_v1_1/activation_17/Relu_geo_prior_model_v1_1/dense_18/BiasAdd_dense/bias"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": true}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "transpose_b": {"b": false}}}, {"name": "geo_prior_model_v1_1/residual_layer_8/dense_19/MatMul_geo_prior_model_v1_1/residual_layer_8/activation_18/Relu_geo_prior_model_v1_1/residual_layer_8/dense_19/BiasAdd_dense/Relu", "op": "_FusedMatMul", "input": ["geo_prior_model_v1_1/dense_18/MatMul_geo_prior_model_v1_1/activation_17/Relu_geo_prior_model_v1_1/dense_18/BiasAdd_dense/Relu", "geo_prior_model_v1_1/residual_layer_8/dense_19/MatMul_geo_prior_model_v1_1/residual_layer_8/activation_18/Relu_geo_prior_model_v1_1/residual_layer_8/dense_19/BiasAdd_dense/kernel", "geo_prior_model_v1_1/residual_layer_8/dense_19/MatMul_geo_prior_model_v1_1/residual_layer_8/activation_18/Relu_geo_prior_model_v1_1/residual_layer_8/dense_19/BiasAdd_dense/bias"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}, "transpose_a": {"b": false}, "epsilon": {"f": 0.0}}}, {"name": "geo_prior_model_v1_1/residual_layer_8/dense_20/MatMul_geo_prior_model_v1_1/residual_layer_8/activation_19/Relu_geo_prior_model_v1_1/residual_layer_8/dense_20/BiasAdd_dense/Relu", "op": "_FusedMatMul", "input": ["geo_prior_model_v1_1/residual_layer_8/dense_19/MatMul_geo_prior_model_v1_1/residual_layer_8/activation_18/Relu_geo_prior_model_v1_1/residual_layer_8/dense_19/BiasAdd_dense/Relu", "geo_prior_model_v1_1/residual_layer_8/dense_20/MatMul_geo_prior_model_v1_1/residual_layer_8/activation_19/Relu_geo_prior_model_v1_1/residual_layer_8/dense_20/BiasAdd_dense/kernel", "geo_prior_model_v1_1/residual_layer_8/dense_20/MatMul_geo_prior_model_v1_1/residual_layer_8/activation_19/Relu_geo_prior_model_v1_1/residual_layer_8/dense_20/BiasAdd_dense/bias"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "transpose_a": {"b": false}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.0}}}, {"name": "geo_prior_model_v1_1/residual_layer_8/tf.__operators__.add_8/AddV2", "op": "AddV2", "input": ["geo_prior_model_v1_1/dense_18/MatMul_geo_prior_model_v1_1/activation_17/Relu_geo_prior_model_v1_1/dense_18/BiasAdd_dense/Relu", "geo_prior_model_v1_1/residual_layer_8/dense_20/MatMul_geo_prior_model_v1_1/residual_layer_8/activation_19/Relu_geo_prior_model_v1_1/residual_layer_8/dense_20/BiasAdd_dense/Relu"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "geo_prior_model_v1_1/residual_layer_9/dense_21/MatMul_geo_prior_model_v1_1/residual_layer_9/activation_20/Relu_geo_prior_model_v1_1/residual_layer_9/dense_21/BiasAdd_dense/Relu", "op": "_FusedMatMul", "input": ["geo_prior_model_v1_1/residual_layer_8/tf.__operators__.add_8/AddV2", "geo_prior_model_v1_1/residual_layer_9/dense_21/MatMul_geo_prior_model_v1_1/residual_layer_9/activation_20/Relu_geo_prior_model_v1_1/residual_layer_9/dense_21/BiasAdd_dense/kernel", "geo_prior_model_v1_1/residual_layer_9/dense_21/MatMul_geo_prior_model_v1_1/residual_layer_9/activation_20/Relu_geo_prior_model_v1_1/residual_layer_9/dense_21/BiasAdd_dense/bias"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "transpose_a": {"b": false}, "transpose_b": {"b": false}, "num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.0}}}, {"name": "geo_prior_model_v1_1/residual_layer_9/dense_22/MatMul_geo_prior_model_v1_1/residual_layer_9/activation_21/Relu_geo_prior_model_v1_1/residual_layer_9/dense_22/BiasAdd_dense/Relu", "op": "_FusedMatMul", "input": ["geo_prior_model_v1_1/residual_layer_9/dense_21/MatMul_geo_prior_model_v1_1/residual_layer_9/activation_20/Relu_geo_prior_model_v1_1/residual_layer_9/dense_21/BiasAdd_dense/Relu", "geo_prior_model_v1_1/residual_layer_9/dense_22/MatMul_geo_prior_model_v1_1/residual_layer_9/activation_21/Relu_geo_prior_model_v1_1/residual_layer_9/dense_22/BiasAdd_dense/kernel", "geo_prior_model_v1_1/residual_layer_9/dense_22/MatMul_geo_prior_model_v1_1/residual_layer_9/activation_21/Relu_geo_prior_model_v1_1/residual_layer_9/dense_22/BiasAdd_dense/bias"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "transpose_b": {"b": false}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}}}, {"name": "geo_prior_model_v1_1/residual_layer_9/tf.__operators__.add_9/AddV2", "op": "AddV2", "input": ["geo_prior_model_v1_1/residual_layer_8/tf.__operators__.add_8/AddV2", "geo_prior_model_v1_1/residual_layer_9/dense_22/MatMul_geo_prior_model_v1_1/residual_layer_9/activation_21/Relu_geo_prior_model_v1_1/residual_layer_9/dense_22/BiasAdd_dense/Relu"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "geo_prior_model_v1_1/residual_layer_10/dense_23/MatMul_geo_prior_model_v1_1/residual_layer_10/activation_22/Relu_geo_prior_model_v1_1/residual_layer_10/dense_23/BiasAdd_dense/Relu", "op": "_FusedMatMul", "input": ["geo_prior_model_v1_1/residual_layer_9/tf.__operators__.add_9/AddV2", "geo_prior_model_v1_1/residual_layer_10/dense_23/MatMul_geo_prior_model_v1_1/residual_layer_10/activation_22/Relu_geo_prior_model_v1_1/residual_layer_10/dense_23/BiasAdd_dense/kernel", "geo_prior_model_v1_1/residual_layer_10/dense_23/MatMul_geo_prior_model_v1_1/residual_layer_10/activation_22/Relu_geo_prior_model_v1_1/residual_layer_10/dense_23/BiasAdd_dense/bias"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "transpose_a": {"b": false}, "num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "epsilon": {"f": 0.0}}}, {"name": "geo_prior_model_v1_1/residual_layer_10/dense_24/MatMul_geo_prior_model_v1_1/residual_layer_10/activation_23/Relu_geo_prior_model_v1_1/residual_layer_10/dense_24/BiasAdd_dense/Relu", "op": "_FusedMatMul", "input": ["geo_prior_model_v1_1/residual_layer_10/dense_23/MatMul_geo_prior_model_v1_1/residual_layer_10/activation_22/Relu_geo_prior_model_v1_1/residual_layer_10/dense_23/BiasAdd_dense/Relu", "geo_prior_model_v1_1/residual_layer_10/dense_24/MatMul_geo_prior_model_v1_1/residual_layer_10/activation_23/Relu_geo_prior_model_v1_1/residual_layer_10/dense_24/BiasAdd_dense/kernel", "geo_prior_model_v1_1/residual_layer_10/dense_24/MatMul_geo_prior_model_v1_1/residual_layer_10/activation_23/Relu_geo_prior_model_v1_1/residual_layer_10/dense_24/BiasAdd_dense/bias"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "transpose_b": {"b": false}}}, {"name": "geo_prior_model_v1_1/residual_layer_10/tf.__operators__.add_10/AddV2", "op": "AddV2", "input": ["geo_prior_model_v1_1/residual_layer_9/tf.__operators__.add_9/AddV2", "geo_prior_model_v1_1/residual_layer_10/dense_24/MatMul_geo_prior_model_v1_1/residual_layer_10/activation_23/Relu_geo_prior_model_v1_1/residual_layer_10/dense_24/BiasAdd_dense/Relu"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "geo_prior_model_v1_1/residual_layer_11/dense_25/MatMul_geo_prior_model_v1_1/residual_layer_11/activation_24/Relu_geo_prior_model_v1_1/residual_layer_11/dense_25/BiasAdd_dense/Relu", "op": "_FusedMatMul", "input": ["geo_prior_model_v1_1/residual_layer_10/tf.__operators__.add_10/AddV2", "geo_prior_model_v1_1/residual_layer_11/dense_25/MatMul_geo_prior_model_v1_1/residual_layer_11/activation_24/Relu_geo_prior_model_v1_1/residual_layer_11/dense_25/BiasAdd_dense/kernel", "geo_prior_model_v1_1/residual_layer_11/dense_25/MatMul_geo_prior_model_v1_1/residual_layer_11/activation_24/Relu_geo_prior_model_v1_1/residual_layer_11/dense_25/BiasAdd_dense/bias"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "transpose_b": {"b": false}, "epsilon": {"f": 0.0}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "geo_prior_model_v1_1/residual_layer_11/dense_26/MatMul_geo_prior_model_v1_1/residual_layer_11/activation_25/Relu_geo_prior_model_v1_1/residual_layer_11/dense_26/BiasAdd_dense/Relu", "op": "_FusedMatMul", "input": ["geo_prior_model_v1_1/residual_layer_11/dense_25/MatMul_geo_prior_model_v1_1/residual_layer_11/activation_24/Relu_geo_prior_model_v1_1/residual_layer_11/dense_25/BiasAdd_dense/Relu", "geo_prior_model_v1_1/residual_layer_11/dense_26/MatMul_geo_prior_model_v1_1/residual_layer_11/activation_25/Relu_geo_prior_model_v1_1/residual_layer_11/dense_26/BiasAdd_dense/kernel", "geo_prior_model_v1_1/residual_layer_11/dense_26/MatMul_geo_prior_model_v1_1/residual_layer_11/activation_25/Relu_geo_prior_model_v1_1/residual_layer_11/dense_26/BiasAdd_dense/bias"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "transpose_a": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "geo_prior_model_v1_1/residual_layer_11/tf.__operators__.add_11/AddV2", "op": "AddV2", "input": ["geo_prior_model_v1_1/residual_layer_10/tf.__operators__.add_10/AddV2", "geo_prior_model_v1_1/residual_layer_11/dense_26/MatMul_geo_prior_model_v1_1/residual_layer_11/activation_25/Relu_geo_prior_model_v1_1/residual_layer_11/dense_26/BiasAdd_dense/Relu"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "geo_prior_model_v1_1/residual_layer_12/dense_27/MatMul_geo_prior_model_v1_1/residual_layer_12/activation_26/Relu_geo_prior_model_v1_1/residual_layer_12/dense_27/BiasAdd_dense/Relu", "op": "_FusedMatMul", "input": ["geo_prior_model_v1_1/residual_layer_11/tf.__operators__.add_11/AddV2", "geo_prior_model_v1_1/residual_layer_12/dense_27/MatMul_geo_prior_model_v1_1/residual_layer_12/activation_26/Relu_geo_prior_model_v1_1/residual_layer_12/dense_27/BiasAdd_dense/kernel", "geo_prior_model_v1_1/residual_layer_12/dense_27/MatMul_geo_prior_model_v1_1/residual_layer_12/activation_26/Relu_geo_prior_model_v1_1/residual_layer_12/dense_27/BiasAdd_dense/bias"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}, "epsilon": {"f": 0.0}, "num_args": {"i": "1"}, "transpose_a": {"b": false}}}, {"name": "geo_prior_model_v1_1/residual_layer_12/dense_28/MatMul_geo_prior_model_v1_1/residual_layer_12/activation_27/Relu_geo_prior_model_v1_1/residual_layer_12/dense_28/BiasAdd_dense/Relu", "op": "_FusedMatMul", "input": ["geo_prior_model_v1_1/residual_layer_12/dense_27/MatMul_geo_prior_model_v1_1/residual_layer_12/activation_26/Relu_geo_prior_model_v1_1/residual_layer_12/dense_27/BiasAdd_dense/Relu", "geo_prior_model_v1_1/residual_layer_12/dense_28/MatMul_geo_prior_model_v1_1/residual_layer_12/activation_27/Relu_geo_prior_model_v1_1/residual_layer_12/dense_28/BiasAdd_dense/kernel", "geo_prior_model_v1_1/residual_layer_12/dense_28/MatMul_geo_prior_model_v1_1/residual_layer_12/activation_27/Relu_geo_prior_model_v1_1/residual_layer_12/dense_28/BiasAdd_dense/bias"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "transpose_b": {"b": false}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "transpose_a": {"b": false}}}, {"name": "geo_prior_model_v1_1/residual_layer_12/tf.__operators__.add_12/AddV2", "op": "AddV2", "input": ["geo_prior_model_v1_1/residual_layer_11/tf.__operators__.add_11/AddV2", "geo_prior_model_v1_1/residual_layer_12/dense_28/MatMul_geo_prior_model_v1_1/residual_layer_12/activation_27/Relu_geo_prior_model_v1_1/residual_layer_12/dense_28/BiasAdd_dense/Relu"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "geo_prior_model_v1_1/residual_layer_13/dense_29/MatMul_geo_prior_model_v1_1/residual_layer_13/activation_28/Relu_geo_prior_model_v1_1/residual_layer_13/dense_29/BiasAdd_dense/Relu", "op": "_FusedMatMul", "input": ["geo_prior_model_v1_1/residual_layer_12/tf.__operators__.add_12/AddV2", "geo_prior_model_v1_1/residual_layer_13/dense_29/MatMul_geo_prior_model_v1_1/residual_layer_13/activation_28/Relu_geo_prior_model_v1_1/residual_layer_13/dense_29/BiasAdd_dense/kernel", "geo_prior_model_v1_1/residual_layer_13/dense_29/MatMul_geo_prior_model_v1_1/residual_layer_13/activation_28/Relu_geo_prior_model_v1_1/residual_layer_13/dense_29/BiasAdd_dense/bias"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "num_args": {"i": "1"}, "transpose_b": {"b": false}, "epsilon": {"f": 0.0}}}, {"name": "geo_prior_model_v1_1/residual_layer_13/dense_30/MatMul_geo_prior_model_v1_1/residual_layer_13/activation_29/Relu_geo_prior_model_v1_1/residual_layer_13/dense_30/BiasAdd_dense/Relu", "op": "_FusedMatMul", "input": ["geo_prior_model_v1_1/residual_layer_13/dense_29/MatMul_geo_prior_model_v1_1/residual_layer_13/activation_28/Relu_geo_prior_model_v1_1/residual_layer_13/dense_29/BiasAdd_dense/Relu", "geo_prior_model_v1_1/residual_layer_13/dense_30/MatMul_geo_prior_model_v1_1/residual_layer_13/activation_29/Relu_geo_prior_model_v1_1/residual_layer_13/dense_30/BiasAdd_dense/kernel", "geo_prior_model_v1_1/residual_layer_13/dense_30/MatMul_geo_prior_model_v1_1/residual_layer_13/activation_29/Relu_geo_prior_model_v1_1/residual_layer_13/dense_30/BiasAdd_dense/bias"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "epsilon": {"f": 0.0}, "num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}}}, {"name": "geo_prior_model_v1_1/residual_layer_13/tf.__operators__.add_13/AddV2", "op": "AddV2", "input": ["geo_prior_model_v1_1/residual_layer_12/tf.__operators__.add_12/AddV2", "geo_prior_model_v1_1/residual_layer_13/dense_30/MatMul_geo_prior_model_v1_1/residual_layer_13/activation_29/Relu_geo_prior_model_v1_1/residual_layer_13/dense_30/BiasAdd_dense/Relu"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "geo_prior_model_v1_1/residual_layer_14/dense_31/MatMul_geo_prior_model_v1_1/residual_layer_14/activation_30/Relu_geo_prior_model_v1_1/residual_layer_14/dense_31/BiasAdd_dense/Relu", "op": "_FusedMatMul", "input": ["geo_prior_model_v1_1/residual_layer_13/tf.__operators__.add_13/AddV2", "geo_prior_model_v1_1/residual_layer_14/dense_31/MatMul_geo_prior_model_v1_1/residual_layer_14/activation_30/Relu_geo_prior_model_v1_1/residual_layer_14/dense_31/BiasAdd_dense/kernel", "geo_prior_model_v1_1/residual_layer_14/dense_31/MatMul_geo_prior_model_v1_1/residual_layer_14/activation_30/Relu_geo_prior_model_v1_1/residual_layer_14/dense_31/BiasAdd_dense/bias"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "transpose_b": {"b": false}, "transpose_a": {"b": false}, "epsilon": {"f": 0.0}, "num_args": {"i": "1"}}}, {"name": "geo_prior_model_v1_1/residual_layer_14/dense_32/MatMul_geo_prior_model_v1_1/residual_layer_14/activation_31/Relu_geo_prior_model_v1_1/residual_layer_14/dense_32/BiasAdd_dense/Relu", "op": "_FusedMatMul", "input": ["geo_prior_model_v1_1/residual_layer_14/dense_31/MatMul_geo_prior_model_v1_1/residual_layer_14/activation_30/Relu_geo_prior_model_v1_1/residual_layer_14/dense_31/BiasAdd_dense/Relu", "geo_prior_model_v1_1/residual_layer_14/dense_32/MatMul_geo_prior_model_v1_1/residual_layer_14/activation_31/Relu_geo_prior_model_v1_1/residual_layer_14/dense_32/BiasAdd_dense/kernel", "geo_prior_model_v1_1/residual_layer_14/dense_32/MatMul_geo_prior_model_v1_1/residual_layer_14/activation_31/Relu_geo_prior_model_v1_1/residual_layer_14/dense_32/BiasAdd_dense/bias"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.0}, "transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "geo_prior_model_v1_1/residual_layer_14/tf.__operators__.add_14/AddV2", "op": "AddV2", "input": ["geo_prior_model_v1_1/residual_layer_13/tf.__operators__.add_13/AddV2", "geo_prior_model_v1_1/residual_layer_14/dense_32/MatMul_geo_prior_model_v1_1/residual_layer_14/activation_31/Relu_geo_prior_model_v1_1/residual_layer_14/dense_32/BiasAdd_dense/Relu"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "geo_prior_model_v1_1/residual_layer_15/dense_33/MatMul_geo_prior_model_v1_1/residual_layer_15/activation_32/Relu_geo_prior_model_v1_1/residual_layer_15/dense_33/BiasAdd_dense/Relu", "op": "_FusedMatMul", "input": ["geo_prior_model_v1_1/residual_layer_14/tf.__operators__.add_14/AddV2", "geo_prior_model_v1_1/residual_layer_15/dense_33/MatMul_geo_prior_model_v1_1/residual_layer_15/activation_32/Relu_geo_prior_model_v1_1/residual_layer_15/dense_33/BiasAdd_dense/kernel", "geo_prior_model_v1_1/residual_layer_15/dense_33/MatMul_geo_prior_model_v1_1/residual_layer_15/activation_32/Relu_geo_prior_model_v1_1/residual_layer_15/dense_33/BiasAdd_dense/bias"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "epsilon": {"f": 0.0}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "geo_prior_model_v1_1/residual_layer_15/dense_34/MatMul_geo_prior_model_v1_1/residual_layer_15/activation_33/Relu_geo_prior_model_v1_1/residual_layer_15/dense_34/BiasAdd_dense/Relu", "op": "_FusedMatMul", "input": ["geo_prior_model_v1_1/residual_layer_15/dense_33/MatMul_geo_prior_model_v1_1/residual_layer_15/activation_32/Relu_geo_prior_model_v1_1/residual_layer_15/dense_33/BiasAdd_dense/Relu", "geo_prior_model_v1_1/residual_layer_15/dense_34/MatMul_geo_prior_model_v1_1/residual_layer_15/activation_33/Relu_geo_prior_model_v1_1/residual_layer_15/dense_34/BiasAdd_dense/kernel", "geo_prior_model_v1_1/residual_layer_15/dense_34/MatMul_geo_prior_model_v1_1/residual_layer_15/activation_33/Relu_geo_prior_model_v1_1/residual_layer_15/dense_34/BiasAdd_dense/bias"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "num_args": {"i": "1"}, "transpose_b": {"b": false}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "geo_prior_model_v1_1/residual_layer_15/tf.__operators__.add_15/AddV2", "op": "AddV2", "input": ["geo_prior_model_v1_1/residual_layer_14/tf.__operators__.add_14/AddV2", "geo_prior_model_v1_1/residual_layer_15/dense_34/MatMul_geo_prior_model_v1_1/residual_layer_15/activation_33/Relu_geo_prior_model_v1_1/residual_layer_15/dense_34/BiasAdd_dense/Relu"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "geo_prior_model_v1_1/dense_35/MatMul_geo_prior_model_v1_1/dense_35/BiasAdd_dense/BiasAdd", "op": "_FusedMatMul", "input": ["geo_prior_model_v1_1/residual_layer_15/tf.__operators__.add_15/AddV2", "geo_prior_model_v1_1/dense_35/MatMul_geo_prior_model_v1_1/dense_35/BiasAdd_dense/kernel", "geo_prior_model_v1_1/dense_35/MatMul_geo_prior_model_v1_1/dense_35/BiasAdd_dense/bias"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_a": {"b": false}, "transpose_b": {"b": false}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}}}, {"name": "StatefulPartitionedCall", "op": "Sigmoid", "input": ["geo_prior_model_v1_1/dense_35/MatMul_geo_prior_model_v1_1/dense_35/BiasAdd_dense/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1087}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "truediv_truediv/y1", "shape": [], "dtype": "float32"}, {"name": "truediv_1_truediv_1/y1", "shape": [], "dtype": "float32"}, {"name": "truediv_2_truediv_2/y1", "shape": [], "dtype": "float32"}, {"name": "sub/y", "shape": [], "dtype": "float32"}, {"name": "mul_5/y", "shape": [], "dtype": "float32"}, {"name": "geo_prior_model_v1_1/dense_18/MatMul_geo_prior_model_v1_1/activation_17/Relu_geo_prior_model_v1_1/dense_18/BiasAdd_dense/kernel", "shape": [6, 128], "dtype": "float32"}, {"name": "geo_prior_model_v1_1/dense_18/MatMul_geo_prior_model_v1_1/activation_17/Relu_geo_prior_model_v1_1/dense_18/BiasAdd_dense/bias", "shape": [128], "dtype": "float32"}, {"name": "geo_prior_model_v1_1/residual_layer_8/dense_19/MatMul_geo_prior_model_v1_1/residual_layer_8/activation_18/Relu_geo_prior_model_v1_1/residual_layer_8/dense_19/BiasAdd_dense/kernel", "shape": [128, 128], "dtype": "float32"}, {"name": "geo_prior_model_v1_1/residual_layer_8/dense_19/MatMul_geo_prior_model_v1_1/residual_layer_8/activation_18/Relu_geo_prior_model_v1_1/residual_layer_8/dense_19/BiasAdd_dense/bias", "shape": [128], "dtype": "float32"}, {"name": "geo_prior_model_v1_1/residual_layer_8/dense_20/MatMul_geo_prior_model_v1_1/residual_layer_8/activation_19/Relu_geo_prior_model_v1_1/residual_layer_8/dense_20/BiasAdd_dense/kernel", "shape": [128, 128], "dtype": "float32"}, {"name": "geo_prior_model_v1_1/residual_layer_8/dense_20/MatMul_geo_prior_model_v1_1/residual_layer_8/activation_19/Relu_geo_prior_model_v1_1/residual_layer_8/dense_20/BiasAdd_dense/bias", "shape": [128], "dtype": "float32"}, {"name": "geo_prior_model_v1_1/residual_layer_9/dense_21/MatMul_geo_prior_model_v1_1/residual_layer_9/activation_20/Relu_geo_prior_model_v1_1/residual_layer_9/dense_21/BiasAdd_dense/kernel", "shape": [128, 128], "dtype": "float32"}, {"name": "geo_prior_model_v1_1/residual_layer_9/dense_21/MatMul_geo_prior_model_v1_1/residual_layer_9/activation_20/Relu_geo_prior_model_v1_1/residual_layer_9/dense_21/BiasAdd_dense/bias", "shape": [128], "dtype": "float32"}, {"name": "geo_prior_model_v1_1/residual_layer_9/dense_22/MatMul_geo_prior_model_v1_1/residual_layer_9/activation_21/Relu_geo_prior_model_v1_1/residual_layer_9/dense_22/BiasAdd_dense/kernel", "shape": [128, 128], "dtype": "float32"}, {"name": "geo_prior_model_v1_1/residual_layer_9/dense_22/MatMul_geo_prior_model_v1_1/residual_layer_9/activation_21/Relu_geo_prior_model_v1_1/residual_layer_9/dense_22/BiasAdd_dense/bias", "shape": [128], "dtype": "float32"}, {"name": "geo_prior_model_v1_1/residual_layer_10/dense_23/MatMul_geo_prior_model_v1_1/residual_layer_10/activation_22/Relu_geo_prior_model_v1_1/residual_layer_10/dense_23/BiasAdd_dense/kernel", "shape": [128, 128], "dtype": "float32"}, {"name": "geo_prior_model_v1_1/residual_layer_10/dense_23/MatMul_geo_prior_model_v1_1/residual_layer_10/activation_22/Relu_geo_prior_model_v1_1/residual_layer_10/dense_23/BiasAdd_dense/bias", "shape": [128], "dtype": "float32"}, {"name": "geo_prior_model_v1_1/residual_layer_10/dense_24/MatMul_geo_prior_model_v1_1/residual_layer_10/activation_23/Relu_geo_prior_model_v1_1/residual_layer_10/dense_24/BiasAdd_dense/kernel", "shape": [128, 128], "dtype": "float32"}, {"name": "geo_prior_model_v1_1/residual_layer_10/dense_24/MatMul_geo_prior_model_v1_1/residual_layer_10/activation_23/Relu_geo_prior_model_v1_1/residual_layer_10/dense_24/BiasAdd_dense/bias", "shape": [128], "dtype": "float32"}, {"name": "geo_prior_model_v1_1/residual_layer_11/dense_25/MatMul_geo_prior_model_v1_1/residual_layer_11/activation_24/Relu_geo_prior_model_v1_1/residual_layer_11/dense_25/BiasAdd_dense/kernel", "shape": [128, 128], "dtype": "float32"}, {"name": "geo_prior_model_v1_1/residual_layer_11/dense_25/MatMul_geo_prior_model_v1_1/residual_layer_11/activation_24/Relu_geo_prior_model_v1_1/residual_layer_11/dense_25/BiasAdd_dense/bias", "shape": [128], "dtype": "float32"}, {"name": "geo_prior_model_v1_1/residual_layer_11/dense_26/MatMul_geo_prior_model_v1_1/residual_layer_11/activation_25/Relu_geo_prior_model_v1_1/residual_layer_11/dense_26/BiasAdd_dense/kernel", "shape": [128, 128], "dtype": "float32"}, {"name": "geo_prior_model_v1_1/residual_layer_11/dense_26/MatMul_geo_prior_model_v1_1/residual_layer_11/activation_25/Relu_geo_prior_model_v1_1/residual_layer_11/dense_26/BiasAdd_dense/bias", "shape": [128], "dtype": "float32"}, {"name": "geo_prior_model_v1_1/residual_layer_12/dense_27/MatMul_geo_prior_model_v1_1/residual_layer_12/activation_26/Relu_geo_prior_model_v1_1/residual_layer_12/dense_27/BiasAdd_dense/kernel", "shape": [128, 128], "dtype": "float32"}, {"name": "geo_prior_model_v1_1/residual_layer_12/dense_27/MatMul_geo_prior_model_v1_1/residual_layer_12/activation_26/Relu_geo_prior_model_v1_1/residual_layer_12/dense_27/BiasAdd_dense/bias", "shape": [128], "dtype": "float32"}, {"name": "geo_prior_model_v1_1/residual_layer_12/dense_28/MatMul_geo_prior_model_v1_1/residual_layer_12/activation_27/Relu_geo_prior_model_v1_1/residual_layer_12/dense_28/BiasAdd_dense/kernel", "shape": [128, 128], "dtype": "float32"}, {"name": "geo_prior_model_v1_1/residual_layer_12/dense_28/MatMul_geo_prior_model_v1_1/residual_layer_12/activation_27/Relu_geo_prior_model_v1_1/residual_layer_12/dense_28/BiasAdd_dense/bias", "shape": [128], "dtype": "float32"}, {"name": "geo_prior_model_v1_1/residual_layer_13/dense_29/MatMul_geo_prior_model_v1_1/residual_layer_13/activation_28/Relu_geo_prior_model_v1_1/residual_layer_13/dense_29/BiasAdd_dense/kernel", "shape": [128, 128], "dtype": "float32"}, {"name": "geo_prior_model_v1_1/residual_layer_13/dense_29/MatMul_geo_prior_model_v1_1/residual_layer_13/activation_28/Relu_geo_prior_model_v1_1/residual_layer_13/dense_29/BiasAdd_dense/bias", "shape": [128], "dtype": "float32"}, {"name": "geo_prior_model_v1_1/residual_layer_13/dense_30/MatMul_geo_prior_model_v1_1/residual_layer_13/activation_29/Relu_geo_prior_model_v1_1/residual_layer_13/dense_30/BiasAdd_dense/kernel", "shape": [128, 128], "dtype": "float32"}, {"name": "geo_prior_model_v1_1/residual_layer_13/dense_30/MatMul_geo_prior_model_v1_1/residual_layer_13/activation_29/Relu_geo_prior_model_v1_1/residual_layer_13/dense_30/BiasAdd_dense/bias", "shape": [128], "dtype": "float32"}, {"name": "geo_prior_model_v1_1/residual_layer_14/dense_31/MatMul_geo_prior_model_v1_1/residual_layer_14/activation_30/Relu_geo_prior_model_v1_1/residual_layer_14/dense_31/BiasAdd_dense/kernel", "shape": [128, 128], "dtype": "float32"}, {"name": "geo_prior_model_v1_1/residual_layer_14/dense_31/MatMul_geo_prior_model_v1_1/residual_layer_14/activation_30/Relu_geo_prior_model_v1_1/residual_layer_14/dense_31/BiasAdd_dense/bias", "shape": [128], "dtype": "float32"}, {"name": "geo_prior_model_v1_1/residual_layer_14/dense_32/MatMul_geo_prior_model_v1_1/residual_layer_14/activation_31/Relu_geo_prior_model_v1_1/residual_layer_14/dense_32/BiasAdd_dense/kernel", "shape": [128, 128], "dtype": "float32"}, {"name": "geo_prior_model_v1_1/residual_layer_14/dense_32/MatMul_geo_prior_model_v1_1/residual_layer_14/activation_31/Relu_geo_prior_model_v1_1/residual_layer_14/dense_32/BiasAdd_dense/bias", "shape": [128], "dtype": "float32"}, {"name": "geo_prior_model_v1_1/residual_layer_15/dense_33/MatMul_geo_prior_model_v1_1/residual_layer_15/activation_32/Relu_geo_prior_model_v1_1/residual_layer_15/dense_33/BiasAdd_dense/kernel", "shape": [128, 128], "dtype": "float32"}, {"name": "geo_prior_model_v1_1/residual_layer_15/dense_33/MatMul_geo_prior_model_v1_1/residual_layer_15/activation_32/Relu_geo_prior_model_v1_1/residual_layer_15/dense_33/BiasAdd_dense/bias", "shape": [128], "dtype": "float32"}, {"name": "geo_prior_model_v1_1/residual_layer_15/dense_34/MatMul_geo_prior_model_v1_1/residual_layer_15/activation_33/Relu_geo_prior_model_v1_1/residual_layer_15/dense_34/BiasAdd_dense/kernel", "shape": [128, 128], "dtype": "float32"}, {"name": "geo_prior_model_v1_1/residual_layer_15/dense_34/MatMul_geo_prior_model_v1_1/residual_layer_15/activation_33/Relu_geo_prior_model_v1_1/residual_layer_15/dense_34/BiasAdd_dense/bias", "shape": [128], "dtype": "float32"}, {"name": "geo_prior_model_v1_1/dense_35/MatMul_geo_prior_model_v1_1/dense_35/BiasAdd_dense/kernel", "shape": [128, 2233], "dtype": "float32"}, {"name": "geo_prior_model_v1_1/dense_35/MatMul_geo_prior_model_v1_1/dense_35/BiasAdd_dense/bias", "shape": [2233], "dtype": "float32"}]}]}